// Задача #1

// let n = prompt("Как вас зовут: ?", "No name");
// let a = prompt("Сколько вам лет: ?", "No");
// let h = prompt("Какой у вас рост: ?", "No");

// console.log(`
//     Ваше имя: ${n}
//     Ваш возраст: ${a}
//     Ваш рост: ${h}
// `);


// Задача #2


// let symb = prompt("Введите ваше число: ?", "1");

// console.log(Number(symb));

// Не понял

// Задача #3

// let num = prompt("Введите ваше число: ?", "2");

// if (num % 2 == 0) {
//     console.log("Четное");
// } else {
//     console.log("Не четное");
// }

// Задача #4

// let n1 = prompt("Введите ваше число: ?", "1");
// let n2 = prompt("Введите ваше число: ?", "2");
// let n3 = prompt("Введите ваше число: ?", "3");

// if (n1 > n2 && n1 > n3) {
//     console.log("Число под первым номеров самое большое");
// } else if (n2 > n1 && n2 > n3) {
//     console.log("Число под вторым номеров самое большое");
// } else {
//     console.log("Число под третьем номеров самое большое");
// }


// Задача #5

// let n1 = prompt("Введите ваше число: ?", "1");
// let n2 = prompt("Введите ваше число: ?", "2");

// isNaN - проверка на правильность

// if (isNaN(n1) || isNaN(n2)) {
//     console.log("ошибка");
// } else {
//     console.log("все верно");
// }


// Задача #6

// let n = prompt("Введите ваше число: ?");

// if (n == 1 || n == 2 || n == 12) {
//     console.log("Сейчас зима");
// } else if (n == 3 || n == 4 || n == 5) {
//     console.log("Сейчас весна");
// } else if (n == 6 || n == 7 || n == 8) {
//     console.log("Сейчас лето");
// } else if (n == 9 || n == 10 || n == 11) {
//     console.log("Сейчас осень");
// }


// Задача #7

// let n1 = prompt("Ваш возраст: ");
// let n2 = prompt("Ваш рост: ");

// if (n1 >= 18 && n2 > 160) {
//     console.log("Вы можете участвовать в соревновании.");
// } else if (n1 < 18) {
//     console.log("Вы слишком молоды");
// } else if (n2 < 160) {
//     console.log("Вы не проходите по росту");
// }